# Apply Function

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    "Country": ['India', 'Usa', "Uk"],
    "Capital_city" : ["Delhi", "Washington DC", "Londan"]
})

In [4]:
df

  Country   Capital_city
0   India          Delhi
1     Usa  Washington DC
2      Uk         Londan

In [6]:
table = pd.DataFrame({
    "Numbers1" : np.array([1,2,3,4,5,6]),
    "Numbers2" : np.array([11,12,13,14,15,16])
 })

In [7]:
table

   Numbers1  Numbers2
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15
5         6        16

In [28]:
l = [1,2,3,4]
y = lambda x : x**2
y(9)

81

In [27]:
for i in l:
    print(y(i))

1
4
9
16

In [46]:
l
n = list(map((lambda x : x**3), l))

In [47]:
print(n)

[1, 8, 27, 64]

In [50]:
table.apply(lambda x : x**2)

   Numbers1  Numbers2
0         1       121
1         4       144
2         9       169
3        16       196
4        25       225
5        36       256

In [51]:
table

   Numbers1  Numbers2
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15
5         6        16

In [54]:
table[["Numbers1"]].apply(lambda y : y+50)

   Numbers1
0        51
1        52
2        53
3        54
4        55
5        56

In [55]:
table.apply(np.sqrt)

   Numbers1  Numbers2
0  1.000000  3.316625
1  1.414214  3.464102
2  1.732051  3.605551
3  2.000000  3.741657
4  2.236068  3.872983
5  2.449490  4.000000

In [56]:
table.apply(np.cbrt)

   Numbers1  Numbers2
0  1.000000  2.223980
1  1.259921  2.289428
2  1.442250  2.351335
3  1.587401  2.410142
4  1.709976  2.466212
5  1.817121  2.519842

In [57]:
odd_sqr = pd.DataFrame({
    "Numbers1" : np.array([1,2,3,4,5,6,7,8,9,10]),
    "Numbers2" : np.array([11,12,13,14,15,16,17,18,19,20])
 })

In [58]:
odd_sqr

   Numbers1  Numbers2
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15
5         6        16
6         7        17
7         8        18
8         9        19
9        10        20

In [100]:
def square(num):
    if num%2 == 0:
        return num**3
    else:
        return  num

In [101]:
odd_sqr[["Numbers1"]].apply(square)

   Numbers1
0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8
8         9
9        10

In [116]:
for i in odd_sqr.index:
    if i % 2 == 0:
        display(odd_sqr[i:i+1])

   Numbers1  Numbers2
0         1        11

   Numbers1  Numbers2
2         3        13

   Numbers1  Numbers2
4         5        15

   Numbers1  Numbers2
6         7        17

   Numbers1  Numbers2
8         9        19

In [122]:
def squ(num):
    for i in odd_sqr.index:
        if i % 2 == 0:
            return num**2
        else:
            return num

In [120]:
odd_sqr[["Numbers1"]].apply(squ)

   Numbers1
0         1
1         4
2         9
3        16
4        25
5        36
6        49
7        64
8        81
9       100

In [124]:
odd_sqr

   Numbers1  Numbers2
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15
5         6        16
6         7        17
7         8        18
8         9        19
9        10        20

In [127]:
def sqrare(num):
    return num**2

In [136]:
odd_sqr[["Numbers1"]].apply(lambda x : x**2 if (x%2))

SyntaxError: invalid syntax (1074542243.py, line 1)

In [142]:
all([1,2,3,4,5,6,7,8,9])

True

In [143]:
any([1,2,3,4,5,6,7,8,9])

True